import '../../style/services_style/Consult.css';
import '../../style/BuyEstateInfo.css';

function Consult() {
    return (
        <div className="consult-container">
            <img src='https://profirealt.com.ua/wp-content/uploads/2020/09/service3.1-500x500.jpg'></img>
            <div>
                <div className="consult-title">
                    <span>1</span>
                    <p className="inner-title-ul">ЮРИДИЧНІ КОНСУЛЬТАЦІЇ</p>
                </div>
                <ul className="ul-buy-for">
                    <li>
                        <i className="ri-check-line"></i>
                        <p>Консультації з продажу (купівлі) квартир, приватних будинків, земельних ділянок,
                            дачних будинків, комерційної нерухомості, а також оподаткування, що виникає при операціях
                            з об’єктами нерухомості;</p>
                    </li>
                    <li>
                        <i className="ri-check-line"></i>
                        <p>Консультація, проведення переговорів, супровід договору купівлі-продажу об’єкта нерухомості;</p>
                    </li>
                    <li>
                        <i className="ri-check-line"></i>
                        <p>Консультації та допомога в знятті заборон на відчуження та арештів з об’єктів нерухомості;</p>
                    </li>
                    <li>
                        <i className="ri-check-line"></i>
                        <p>Консультації та допомога в операціях з об’єктами нерухомості, де власниками є особи,
                            які не досягли повноліття;</p>
                    </li>
                    <li>
                        <i className="ri-check-line"></i>
                        <p>Консультації й надання допомоги щодо зняття з реєстрації осіб, які не досягли повноліття,
                            військовозобов’язаних,  померлих;</p>
                    </li>
                    <li>
                        <i className="ri-check-line"></i>
                        <p>Консультації та супровід (підготовка документів) в процесі оформлення спадщини за законом
                            і заповітом;</p>
                    </li>
                    <li>
                        <i className="ri-check-line"></i>
                        <p>Консультації та супровід (підготовка документів) в оформленні договорів дарування квартир,
                            будинків, земельних ділянок;</p>
                    </li>
                    <li>
                        <i className="ri-check-line"></i>
                        <p>Юридична допомога по приватизації квартир, земельних ділянок та інших об’єктів нерухомості.</p>
                    </li>
                    <li>
                        <i className="ri-check-line"></i>
                        <p>Проведення переговорів і укладення попередніх договорів купівлі-продажу об’єктів нерухомості;</p>
                    </li>
                    <li>
                        <i className="ri-check-line"></i>
                        <p>Юридична допомога в придбанні об’єктів нерухомості в новобудовах Києва та Київської області;</p>
                    </li>
                    <li>
                        <i className="ri-check-line"></i>
                        <p>Повний аналіз і прорахунок ризиків інвестування в новобудови Києва та Київської області.</p>
                    </li>
                    <li>
                        <i className="ri-check-line"></i>
                        <p>Послуги адвоката;</p>
                    </li>
                </ul>
            </div>

            {/*<div className="buy-estate-grid">*/}

            {/*    <div className="buy-estate-grid-item"*/}
            {/*        style={{ backgroundImage: 'url(https://profirealt.com.ua/wp-content/uploads/2020/09/service3.3-500x500.jpg)' }}>*/}
            {/*    </div>*/}

            {/*    <div className="buy-estate-grid-item right">*/}
            {/*        <div>*/}
            {/*            <span>2</span>*/}
            {/*            <p className="inner-title-ul">ДОПОМОГА В ОФОРМЛЕННІ (ПІДГОТОВЦІ) ВСІХ ДОКУМЕНТІВ, НЕОБХІДНИХ*/}
            {/*                ДЛЯ ПІДПИСАННЯ ДОГОВОРУ КУПІВЛІ / ПРОДАЖУ, А ТАКОЖ:</p>*/}
            {/*        </div>*/}
            {/*        <ul className="ul-buy-for">*/}
            {/*            <li>*/}
            {/*                <i className="ri-check-line"></i>*/}
            {/*                <p>оцінка об’єктів нерухомості;</p>*/}
            {/*            </li>*/}
            {/*            <li>*/}
            {/*                <i className="ri-check-line"></i>*/}
            {/*                <p>технічна документація (технічні паспорти) на об’єкти нерухомості;</p>*/}
            {/*            </li>*/}
            {/*            <li>*/}
            {/*                <i className="ri-check-line"></i>*/}
            {/*                <p>довідки про відсутність заборгованості за постачання електроенергії;</p>*/}
            {/*            </li>*/}
            {/*            <li>*/}
            {/*                <i className="ri-check-line"></i>*/}
            {/*                <p>довідки про відсутність заборгованості за постачання та водовідведення гарячої/холодної*/}
            {/*                    води та опаленню;</p>*/}
            {/*            </li>*/}
            {/*            <li>*/}
            {/*                <i className="ri-check-line"></i>*/}
            {/*                <p>довідки про відсутність заборгованості за постачання природного газу;</p>*/}
            {/*            </li>*/}
            {/*            <li>*/}
            {/*                <i className="ri-check-line"></i>*/}
            {/*                <p>довідки про відсутність заборгованості по обслуговуванню будинків і прибудинкової території</p>*/}
            {/*            </li>*/}
            {/*        </ul>*/}
            {/*        <p>Без черг для замовника!</p>*/}
            {/*    </div>*/}
            {/*</div>*/}

            {/*<div>*/}
            {/*    <div>*/}
            {/*        <span>3</span>*/}
            {/*        <p className="inner-title-ul">ДОПОМОГА В ПЕРЕОФОРМЛЕННІ ДОГОВОРІВ З КОМУНАЛЬНИМИ СЛУЖБАМИ М.КИЄВА*/}
            {/*            ПІСЛЯ ОПЕРАЦІЇ, А САМЕ:</p>*/}
            {/*    </div>*/}
            {/*    <ul className="ul-buy-for">*/}
            {/*        <li>*/}
            {/*            <i className="ri-check-line"></i>*/}
            {/*            <p>Енерго;</p>*/}
            {/*        </li>*/}
            {/*        <li>*/}
            {/*            <i className="ri-check-line"></i>*/}
            {/*            <p>Тепломережі;</p>*/}
            {/*        </li>*/}
            {/*        <li>*/}
            {/*            <i className="ri-check-line"></i>*/}
            {/*            <p>Газ;</p>*/}
            {/*        </li>*/}
            {/*        <li>*/}
            {/*            <i className="ri-check-line"></i>*/}
            {/*            <p>Водоканал;</p>*/}
            {/*        </li>*/}
            {/*        <li>*/}
            {/*            <i className="ri-check-line"></i>*/}
            {/*            <p>Центр Комунального сервісу;</p>*/}
            {/*        </li>*/}
            {/*        <li>*/}
            {/*            <i className="ri-check-line"></i>*/}
            {/*            <p>Допомога в заміні лічильників гарячої / холодної води, а також опломбування та установка їх*/}
            {/*                на облік у відповідних організаціях.</p>*/}
            {/*        </li>*/}
                    
            {/*    </ul>*/}
            {/*</div>*/}

        </div>
    )
}

export default Consult;