import '../../style/services_style/Help.css';

function Help() {
    return (
        <div className="help-container" id="help">
            <ul className="ul-buy-for">
                <li>
                    <p>1. Зателефонуйте або напишіть нам.</p>
                </li>
                <li>
                    <p>2. Розкажіть про ваші задачі</p>
                </li>
                <li>
                    <p>3. Покажіть агенту об'єкт або опишіть, що хочете придбати.</p>
                </li>
                <li>
                    <p>4. Укладіть з нами угоду про надання послуг.</p>
                </li>
                <li>
                    <p>5. Отримаєте перші результати за 72 години. Наші інструменти і технології спрямовані на отримання
                        швидкого результату. Про всі важливі події ви будете отримувати звіт.</p>
                </li>
            </ul>
        </div>
    )
}

export default Help;