import { useState } from 'react';
import '../style/Reviews.css';
import 'remixicon/fonts/remixicon.css';

function Reviews() {

    const [firstReviewNumber, setFirstReviewNumber] = useState(0);

    const [lastReviewNumber, setLastReviewNumber] = useState(4);

    const handleSlideButton = (num: number) => {
        setFirstReviewNumber(num);
        setLastReviewNumber(num + 4);
    }

    return (
        <div className="reviews-section">
            <div style={{ display:'flex' }}>
                <span className="reviews-logo-back">
                    Відгуки
                </span>
                <div className="reviews-logo">
                    <p>Відгуки<br /> наших<br /> клієнтів</p>
                </div>
                <div className="reviews-slides">
                    {
                        reviewAuthorArray.map((item, index) => {
                            if (index >= firstReviewNumber && index < lastReviewNumber) {
                                return (
                                    <div className="review">
                                        <p className="comment">{reviewContentArray[index]}</p>
                                        <div>
                                            <p className="comment-author">{item}</p>
                                            <p className="comment-date">{reviewDateArray[index]}</p>
                                        </div>
                                    </div>
                                )
                            }
                        })
                    }
                </div>
            </div>
            <div className="reviews-button-slides">
                <ul>
                    <li><button type="button" className={firstReviewNumber == 0 ? "active-button" : ""}
                        onClick={() => handleSlideButton(0)}></button></li>
                    <li><button type="button" className={firstReviewNumber == 4 ? "active-button" : ""}
                        onClick={() => handleSlideButton(4)}></button></li>
                    <li><button type="button" className={firstReviewNumber == 8 ? "active-button" : ""}
                        onClick={() => handleSlideButton(8)}></button></li>
                </ul>
            </div>
        </div>
    )
}

const reviewContentArray = ['Дуже вдячні компанії Profi Realt за швидку купівлю квартири. Особлива подяка ріелтору Маріанні Макаді та юристу Ользі Івановій. На високому рівні проведення переглядів і комунікації у всіх процесах далі.', 
    'Хочу щиро подякувати спеціалістів компанії Юрія Возного і Юнну Бондарчук за чудову роботу і професіоналізм. Був важким продаж квартири і оформлення всіх документів. Але спеціалісти все зробили на високому рівні. Все пройшло без будь - яких ускладнень. Рекомендую всім хто хоче купити / продати нерухомість звертатися до спеціалістів цієї компанії.',
    'Хочу выразить благодарность АН Профи Риелт, в частности риелтору Москаленко Татьяне и юристу Юнне Игоревне.Спасибо за профессионализм, оперативность и высококачественный подход к своему делу.Однозначно буду рекомендовать Вас своим друзьям и знакомым и при своей следующей продаже снова буду обращаться к Вам! СПАСИБО!',
    'Від щирого серця хочу подякувати за співпрацю фахівцю з нерухомості Марині Писаренко і юристу Валентині Слюсаренко за виконану роботу.За те, що швидко були проведені консультації по всімважливим питанням.Вони зробили все від початку до кінця чудово.Мені не потрібно було самій ходити і збирати різні довідки і документи.',
    'Хочу подякувати за неймовірну роботу ріелтора Анни Митченко, вже вдруге співпрацюємо з нею, всі поточні питання і ньюанси вона вирішує миттєво без нашого втручання, приємно продавати і здавати квартири з таким професійним підходом! Дякую і до нових зустрічей !',
    'Дуже дякую агенству і Валентинки особисто, взялись за мою справу хоча вона і здавалась безвихідною, весь час турботливо тримав мене в курсі всіх нюансів та змін, а також терпляче ставився до особливостей моєї особистості, що дуже важливо було особисто для мене, а також вибивав якомога вигідніші умови для мене. Дякую велике)',
    'Дякую ріелтору Тетяні і юристу Юнні! Було приємно працювати з ними. Консультували по всім питанням, допомагали з документами, навіть самі брали деякі довідки. Значно полегшили процесс. Справжні профі!',
    'Неймовірно задоволена співпрацею з ріелтором Писаренко Мариною та юристом Івановою Ольгою! Професіоналізм, увага до деталей та оперативність вражають. Процес купівлі житла став для мене легким та приємним. Рекомендую всім, хто цінує високий рівень сервісу у сфері нерухомості.',
    'Вдячні ріелтору Маріанні за підготовку проведення угоди з продажу нашої квартири та обговорення всіх моментів на попередньому договорі. Завдяки цьому основна угода щодо Е-оселя пройшла спокійно. гроші від ПриватБанку було зараховано того ж дня нам на рахунок. Все дуже чітко та оперативно та головне швидко. Реально за 3 дні: оцінка, попередній договір, основний договір та розрахунок! Рекомендую однозначно цю агенцію.',
    'Щиро вдячний Маріанні, Валентині та Юнні за Вашу допомогу у купівлі квартири. Ваші поради та рекомендації були мені дуже корисними. Ви завжди були на зв`язку та оперативно вирішували всі питання, що виникали.Завдяки Вам я зміг придбати квартиру своєї мрії. Дуже дякую!',
    'Дуже вдячні ріелторам Юрію і Олені, а також юристу Юнні! Все пройшло дуже швидко, ми знайшли «свою» квартиру в перший же день переглядів і вже через пару тижнів отримали ключі на руки!Команда неймовірно професійна, привітна, і готова допомогти.З такими людьми, навіть не найпростіший процес пройшов дуже швидко і легко.В майбутньому, коли буде потреба, обов‘язково звернемося знову.',
    'Хочу выразить огромную благодарность компании Profi Realt за помощь в покупке квартиры , а в частности риэлтору Москаленко Татьяне и юристу Бондарчук Юнне Игоревне . Полное профессиональное сопровождение от показов до покупки, комфортное общение, предоставления всех нужных документов , пунктуальность во времени , а также во всех тонкостях и ньюансах. При следующей сделке, опять обращусь к этим замечательным и профессиональным специалистам в своем деле!'];

const reviewAuthorArray = ['Юлія', 'Андрій', 'Сергей', 'Світалана Васенко', 'Ольга', 'Маргарита', 'Світлана', 'Ніна', 'Олена',
    'Анатолій', 'Валентина', 'Артем'];

const reviewDateArray = ['2024-02-20 19:34:38', '2024-02-15 22:08:24', '2024-02-15 19:36:12',
    '2024-02-12 13:01:11', '2024-01-17 16:59', '2024-10-01 21:55', '2023-26-12 14:42',
    '2023-24-12 15:49', '2024-28-01 14:05', '2024-09-02 16:24', '2023-20-12 19:52', '2023-11-10 13:31'];

export default Reviews;